Revit 2027 API
Connector.Owner Property
The host of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element Owner { get; }
Public ReadOnly Property Owner As Element
	Get
public:
property Element^ Owner {
	Element^ get ();
}
member Owner : Element with get
Property Value
Element
Remarks
The element that contains this connector. It may also contain other connectors.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace